vedranMv/roverRPi3/roverKernel/tm4c1294_hal.c
/**
 * tm4c1294_hal.c
 *
 *  Created on: 07. 08. 2016.
 *      Author: Vedran Mikov
 */
#include <stdbool.h>
#include <stdint.h>

#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "inc/hw_timer.h"
#include "inc/hw_ints.h"
#include "inc/hw_gpio.h"

#include "driverlib/gpio.h"
#include "driverlib/pin_map.h"
#include "driverlib/sysctl.h"
#include "driverlib/interrupt.h"
#include "driverlib/uart.h"
#include "utils/uartstdio.h"
#include "driverlib/pwm.h"
#include "driverlib/adc.h"
#include "driverlib/i2c.h"
#include "driverlib/timer.h"
#include "driverlib/systick.h"
#include "driverlib/fpu.h"

#include "tm4c1294_hal.h"


uint32_t g_ui32SysClock;

/**     Engines - related macros      */
#define ED_PWM_BASE     PWM0_BASE
#define ED_PWM_LEFT     PWM_OUT_2
#define ED_PWM_RIGHT    PWM_OUT_3
#define ED_HBR_BASE     GPIO_PORTL_BASE             //  H-bridge base
#define ED_HBR_PINL     (GPIO_PIN_0 | GPIO_PIN_1)   //  H-bridge left-wheel pins
#define ED_HBR_PINR     (GPIO_PIN_2 | GPIO_PIN_3)   //  H-bridge right-wheel pins

/**     Radar - related macros        */
#define RADAR_PWM_BASE  PWM0_BASE
///  PWM pin of vertical & horizontal axis of radar
#define RAD_HORIZONTAL  0x00000041
#define RAD_VERTICAL    0x000000C4
///  PWM extremes of radar servos
#define RAD_MAX         59500       //Right/Up
#define RAD_MIN         54000       //Left/Down
#define RAD_PWM_ARG     62498       //PWM generator clock

/**     ESP8266 - related macros        */
#define ESP8266_UART_BASE UART7_BASE

/**     MPU9250 - related macros        */
#define MPU9250_I2C_BASE I2C2_BASE

///-----------------------------------------------------------------------------
///                                                                    [PRIVATE]
///-----------------------------------------------------------------------------
/**
 * Calculate load value from timer based on desired time in milliseconds
 * @param ms time in milliseconds
 * @return equivalent number of clock cycles for main oscillator
 */
uint32_t _TM4CMsToCycles(uint32_t ms)
{
    return (ms*(g_ui32SysClock/1000));
}


///-----------------------------------------------------------------------------
///                                                                     [PUBLIC]
///-----------------------------------------------------------------------------

/**
 *  Dummy function to be called to suppress "Unused variable" warnings
 */
void UNUSED (int32_t arg) { }

/**
 * Initialize microcontroller board clock & enable on-board floating-point unit
 */
void HAL_BOARD_CLOCK_Init()
{
    // Set the clock to use on-board 25MHz oscillator and generate 120MHz clock
    g_ui32SysClock = SysCtlClockFreqSet((SYSCTL_XTAL_25MHZ |
                                        SYSCTL_OSC_MAIN | SYSCTL_USE_PLL |
                                        SYSCTL_CFG_VCO_480), 120000000);
    //  Enable Floating-point unit (FPU)
    FPUEnable();
    FPULazyStackingEnable();
    //  Enable interrupt handler
    IntMasterEnable();
}

/**
 * Wait for given amount of us - blocking function
 * @param us time in us to wait
 */
void HAL_DelayUS(uint32_t us)   //1000
{
    float f = 1000000 / (float)us;//  Frequency = 1 / Period

    f = (float)g_ui32SysClock / (3.0 * f);
    SysCtlDelay((uint32_t)f);
}

/******************************************************************************
 ******************************************************************************
 ************               ESP8266 - related API                  ************
 ******************************************************************************
 ******************************************************************************/

/**
 * Initialize UART port communicating with ESP8266 chip - 8 data bits, no parity,
 * 1 stop bit, no flow control
 * @param baud designated speed of communication
 * @return HAL library error code
 */
uint32_t HAL_ESP_InitPort(uint32_t baud)
{
    static bool pinInit = false;

    //  Prevents reinitializing the pins every time a baud rate is updated
    if (!pinInit)
    {
        //  Configure HW pins for UART and on/off signal
        SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOC);
        GPIOPinConfigure(GPIO_PC4_U7RX);
        GPIOPinConfigure(GPIO_PC5_U7TX);
        GPIOPinTypeUART(GPIO_PORTC_BASE, GPIO_PIN_4 | GPIO_PIN_5);

        GPIOPinTypeGPIOOutput(GPIO_PORTC_BASE, GPIO_PIN_6);
        GPIOPinWrite(GPIO_PORTC_BASE, GPIO_PIN_6, 0x00);

        GPIOPinTypeGPIOOutput(GPIO_PORTC_BASE, GPIO_PIN_7);
        GPIOPinWrite(GPIO_PORTC_BASE, GPIO_PIN_7, 0xFF);

        pinInit = true;
    }

    //    Configure UART 7 peripheral used for ESP communication
    SysCtlPeripheralEnable(SYSCTL_PERIPH_UART7);
    SysCtlPeripheralReset(SYSCTL_PERIPH_UART7);
    UARTClockSourceSet(ESP8266_UART_BASE, UART_CLOCK_SYSTEM);
    UARTConfigSetExpClk(ESP8266_UART_BASE, g_ui32SysClock, baud,
                        (UART_CONFIG_WLEN_8 | UART_CONFIG_STOP_ONE |
                         UART_CONFIG_PAR_NONE));
    UARTEnable(ESP8266_UART_BASE);
    HAL_DelayUS(50000);    //  50ms delay after configuring

    return HAL_OK;
}

/**
 * Attach specific interrupt handler to ESP's UART and configure interrupt to
 * occur on every received character
 */
void HAL_ESP_RegisterIntHandler(void((*intHandler)(void)))
{
    UARTDisable(ESP8266_UART_BASE);
    //  Enable Interrupt on received data
    UARTFIFOLevelSet(ESP8266_UART_BASE,UART_FIFO_TX1_8, UART_FIFO_RX1_8 );
    ///UARTFIFODisable(ESP8266_UART_BASE);
    UARTIntRegister(ESP8266_UART_BASE, intHandler);
    UARTIntEnable(ESP8266_UART_BASE, UART_INT_RX | UART_INT_RT);
    IntDisable(INT_UART7);
    UARTEnable(ESP8266_UART_BASE);
}

/**
 * Enable or disable ESP chip by toggling a pin connected to CH_PD
 * @param enable is state of device
 */
void HAL_ESP_HWEnable(bool enable)
{
    ///    After both actions add a delay to allow chip to settle
    if (!enable)
    {
        GPIOPinWrite(GPIO_PORTC_BASE, GPIO_PIN_6, 0);
        HAL_DelayUS(1000000);
    }
    else
    {
        GPIOPinWrite(GPIO_PORTC_BASE, GPIO_PIN_6, 0xFF);
        HAL_DelayUS(2000000);
    }
}

/**
 * Check whether the chip is enabled or disabled
 */
bool HAL_ESP_IsHWEnabled()
{
    return ((GPIOPinRead(GPIO_PORTC_BASE, GPIO_PIN_6) & GPIO_PIN_6) > 0);
}

/**
 * Enable/disable UART interrupt - interrupt occurs on every char received
 * @param enable
 */
void HAL_ESP_IntEnable(bool enable)
{
    if (enable) IntEnable(INT_UART7);
    else IntDisable(INT_UART7);
}

/**
 * Clear all interrupt flags when an interrupt occurs
 */
int32_t HAL_ESP_ClearInt()
{
    uint32_t retVal = UARTIntStatus(ESP8266_UART_BASE, true);
    //  Clear all raised interrupt flags
    UARTIntClear(ESP8266_UART_BASE, retVal);
    return retVal;
}

/**
 * Check if UART port is busy at the moment
 * @return true: port is currently busy
 *        false: port is free for starting communication
 */
bool HAL_ESP_UARTBusy()
{
    return UARTBusy(ESP8266_UART_BASE);
}

/**
 * Send single char over UART
 * @param arg character to send
 */
void HAL_ESP_SendChar(char arg)
{
    UARTCharPut(ESP8266_UART_BASE, arg);
}

/**
 * Check if there are any characters available in UART RX buffer
 * @return true: there are characters in RX buffer
 *        false: no characters in RX buffer
 */
bool HAL_ESP_CharAvail()
{
    return UARTCharsAvail(ESP8266_UART_BASE);
}

/**
 * Get single character from UART RX buffer
 * @return first character in RX buffer
 */
char  HAL_ESP_GetChar()
{
    return UARTCharGetNonBlocking(ESP8266_UART_BASE);
}

/**
 * Watchdog timer for ESP module - used to reset protocol if communication hangs
 * for too long.
 */
void HAL_ESP_InitWD(void((*intHandler)(void)))
{
    SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER6);
    TimerConfigure(TIMER6_BASE, TIMER_CFG_ONE_SHOT_UP);
    TimerIntRegister(TIMER6_BASE, TIMER_A, intHandler);
    TimerIntEnable(TIMER6_BASE, TIMER_TIMA_TIMEOUT);
    IntEnable(INT_TIMER6A);
}

/**
 * On/Off control for WD timer
 * @param enable desired state of timer (true-run/false-stop)
 * @param ms time in millisec. after which the communication is interrupted
 */
void HAL_ESP_WDControl(bool enable, uint32_t ms)
{
    //  Record last value for timeout, use it when timeout argument is 0
    static uint32_t LTM;
    TimerDisable(TIMER6_BASE, TIMER_A);

    if (enable)
    {
        if (ms != 0)
        {
            TimerLoadSet(TIMER6_BASE, TIMER_A, _TM4CMsToCycles(ms));
            LTM = ms;
        }
        else
            TimerLoadSet(TIMER6_BASE, TIMER_A, _TM4CMsToCycles(LTM));
        TimerEnable(TIMER6_BASE, TIMER_A);
    }
    else if (ms != 0)
        LTM = ms;

