vedranMv/roverRPi3/roverKernel/tm4c1294_hal.c
    //  Set PWM clock divider to 32 - allows for low frequencies
    PWMClockSet(PWM0_BASE, PWM_SYSCLK_DIV_32);

    // Configuration and initialization of Radar left-right PWM output
    GPIOPinConfigure(GPIO_PF1_M0PWM1);
    GPIOPinTypePWM(GPIO_PORTF_BASE, GPIO_PIN_1);
    PWMGenConfigure(PWM0_BASE, PWM_GEN_0,
                    PWM_GEN_MODE_DOWN | PWM_GEN_MODE_NO_SYNC);
    PWMGenPeriodSet(PWM0_BASE, PWM_GEN_0, RAD_PWM_ARG);   //~60Hz PWM clock
    PWMPulseWidthSet(PWM0_BASE, PWM_OUT_1, RAD_MIN+(RAD_MAX-RAD_MIN)/2);    //~10° for servo
    PWMGenEnable(PWM0_BASE, PWM_GEN_0); //Start PWM generator block
    PWMOutputState(PWM0_BASE, PWM_OUT_1_BIT, true);

    // Configuration and initialization of Radar up-down axis PWM output
    GPIOPinConfigure(GPIO_PG0_M0PWM4);
    GPIOPinTypePWM(GPIO_PORTG_BASE, GPIO_PIN_0);
    PWMGenConfigure(PWM0_BASE, PWM_GEN_2,
                    PWM_GEN_MODE_DOWN | PWM_GEN_MODE_NO_SYNC);
    PWMGenPeriodSet(PWM0_BASE, PWM_GEN_2, RAD_PWM_ARG);   //~60Hz PWM clock
    PWMPulseWidthSet(PWM0_BASE, PWM_OUT_4,  RAD_MIN+(RAD_MAX-RAD_MIN)/2);    //~10° for servo
    PWMGenEnable(PWM0_BASE, PWM_GEN_2); //Start PWM generator block
    PWMOutputState(PWM0_BASE, PWM_OUT_4_BIT, true);

    // Configure Radar ADC module to sample AIN 3 (used to read IR sensor output)
    GPIOPinTypeADC(GPIO_PORTE_BASE, GPIO_PIN_0);//  Configure GPIO as ADC input
    ADCSequenceConfigure(ADC0_BASE, 3, ADC_TRIGGER_PROCESSOR, 0);
    ADCSequenceStepConfigure(ADC0_BASE, 3, 0,
                             ADC_CTL_CH3 | ADC_CTL_IE | ADC_CTL_END);
    ADCSequenceEnable(ADC0_BASE, 3);
    ADCIntClear(ADC0_BASE, 3);
    //  Configure hardware averaging of 64 samples
    ADCHardwareOversampleConfigure(ADC0_BASE, 64);

    HAL_RAD_Enable(true);

    //  Wait for gimbal servos to get to specified positions
    SysCtlDelay(g_ui32SysClock/2);
}

/**
 * Enable/disable radar servos
 * @note Disabling servos disables PWM output leaving servos susceptible to any
 * noise on input possibly causing twitching of the joints
 * @param enable
 */
void HAL_RAD_Enable(bool enable)
{
    PWMOutputState(PWM0_BASE, RAD_HORIZONTAL, enable);
    PWMOutputState(PWM0_BASE, RAD_VERTICAL, enable);
}

/**
 * Set vertical(up-down) angle of radar gimbal
 * @param angle to move vertical joint to; 0°(up) to 160° (down)
 */
void HAL_RAD_SetVerAngle(float angle)
{
    float arg = finterpolatef(0.0f, (float)RAD_MIN, 160.0f, (float)RAD_MAX, angle);

    if ((angle > 160.0f) || (angle < 0.0f)) return;
    HAL_SetPWM(RAD_VERTICAL, (uint32_t)arg);
}

/**
 * Get current vertical(up-down) angle of radar gimbal
 * @return angle in range of 0° to 160°
 */
float HAL_RAD_GetVerAngle()
{
    float retVal = (float)HAL_GetPWM(RAD_VERTICAL);

    retVal = finterpolatef((float)RAD_MIN, 0, (float)RAD_MAX, 160, retVal);
    return retVal;
}

/**
 * Set horizontal(left-right) angle of radar gimbal
 * @param angle to move horizontal joint to; 0°(right) to 160° (left)
 */
void HAL_RAD_SetHorAngle(float angle)
{
    float arg = finterpolatef(0.0f, (float)RAD_MAX, 160.0f, (float)RAD_MIN, angle);

    if ((angle > 160.0f) || (angle < 0.0f)) return;
    HAL_SetPWM(RAD_HORIZONTAL, (uint32_t)arg);
}

/**
 * Get current horizontal angle of radar gimbal
 * @return angle in range of 0° to 160°
 */
float HAL_RAD_GetHorAngle()
{
    float retVal = (float)HAL_GetPWM(RAD_HORIZONTAL);

    retVal = finterpolatef((float)RAD_MAX, 0, (float)RAD_MIN, 160, retVal);
    return retVal;
}

/**
 * Read value from analog output of IR distance sensor
 * @return 12-bit analog value of distance measured by IR sensor
 */
uint32_t HAL_RAD_ADCTrigger()
{
    uint32_t retVal;
    ADCProcessorTrigger(ADC0_BASE, 3);
    while(!ADCIntStatus(ADC0_BASE, 3, false));
    ADCIntClear(ADC0_BASE, 3);  //Clear flag
    ADCSequenceDataGet(ADC0_BASE, 3, &retVal);

    return retVal;
}

/******************************************************************************
 ******************************************************************************
 ************               MPU9250 - related API                  ************
 ******************************************************************************
 ******************************************************************************/

/**
 * Initializes I2C 2 bus for communication with MPU (SDA - PN4, SCL - PN5)
 *      Bus frequency 1MHz, connection timeout: 100ms
 * Initializes interrupt pin(PA5) that will be toggled by MPU9250
 *      when it has data available for reading
 *      -PA5 is push-pull pin with weak pull down and 10mA strength
 */
void HAL_MPU_Init(void((*custHook)(void)))
{
    uint32_t ui32TPR;

    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPION);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_I2C2);

    /// Enable I2C communication interface, SCL, SDA lines
    GPIOPinConfigure(GPIO_PN4_I2C2SDA);
    GPIOPinConfigure(GPIO_PN5_I2C2SCL);
    GPIOPinTypeI2CSCL(GPIO_PORTN_BASE, GPIO_PIN_5);
    GPIOPinTypeI2C(GPIO_PORTN_BASE, GPIO_PIN_4);

    I2CMasterEnable(MPU9250_I2C_BASE);

    /// Run I2C bus on 1MHz custom clock
    I2CMasterInitExpClk(MPU9250_I2C_BASE, g_ui32SysClock, true);

    //  Taken from TivaWare library!
    //
    // Compute the clock divider that achieves the fastest speed less than or
    // equal to the desired speed.  The numerator is biased to favor a larger
    // clock divider so that the resulting clock is always less than or equal
    // to the desired clock, never greater.
    //
    ui32TPR = ((120000000 + (2 * 10 * 1000000) - 1) / (2 * 10 * 1000000)) - 1;
    HWREG(MPU9250_I2C_BASE + 0x00C) = ui32TPR;
    while (I2CMasterBusy(MPU9250_I2C_BASE));
    I2CMasterTimeoutSet(MPU9250_I2C_BASE, g_ui32SysClock/10);

    ///  Configure interrupt pin to have weak pull down, 10mA strength
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
    GPIOPinTypeGPIOInput(GPIO_PORTA_BASE, GPIO_PIN_5);
    GPIOPadConfigSet(GPIO_PORTA_BASE, GPIO_PIN_5, GPIO_STRENGTH_10MA, GPIO_PIN_TYPE_STD_WPD);
    GPIOPinWrite(GPIO_PORTA_BASE, GPIO_PIN_5, 0x00);

