vedranMv/roverRPi3/roverKernel/tm4c1294_hal.c
    ///  Set up an interrupt, and interrupt handler
    if (custHook != 0)
    {
        GPIOIntTypeSet(GPIO_PORTA_BASE, GPIO_INT_PIN_5, GPIO_FALLING_EDGE);
        GPIOIntRegister(GPIO_PORTA_BASE, custHook);
        GPIOIntEnable(GPIO_PORTA_BASE, GPIO_INT_PIN_5);
        IntDisable(INT_GPIOA);
    }


    HAL_TIM_Init();
}
/**
 * Write one byte of data to I2C bus and wait until transmission is over (blocking)
 * @param I2Caddress 7-bit address of I2C device (8. bit is for R/W)
 * @param regAddress address of register in I2C device to write into
 * @param data to write into the register of I2C device
 */
void HAL_MPU_WriteByte(uint8_t I2Caddress, uint8_t regAddress, uint8_t data)
{
    I2CMasterSlaveAddrSet(MPU9250_I2C_BASE, I2Caddress, false);
    I2CMasterDataPut(MPU9250_I2C_BASE, regAddress);
    I2CMasterControl(MPU9250_I2C_BASE, I2C_MASTER_CMD_BURST_SEND_START);
    while(!I2CMasterBusy(MPU9250_I2C_BASE));
    while(I2CMasterBusy(MPU9250_I2C_BASE));

    I2CMasterDataPut(MPU9250_I2C_BASE, data);
    I2CMasterControl(MPU9250_I2C_BASE, I2C_MASTER_CMD_BURST_SEND_FINISH);

    while(!I2CMasterBusy(MPU9250_I2C_BASE));
    while(I2CMasterBusy(MPU9250_I2C_BASE));
}

/**
 * Write one byte of data to I2C bus (non-blocking)
 * @param I2Caddress 7-bit address of I2C device (8. bit is for R/W)
 * @param regAddress address of register in I2C device to write into
 * @param data to write into the register of I2C device
 */
void HAL_MPU_WriteByteNB(uint8_t I2Caddress, uint8_t regAddress, uint8_t data)
{
    I2CMasterSlaveAddrSet(MPU9250_I2C_BASE, I2Caddress, false);
    I2CMasterDataPut(MPU9250_I2C_BASE, regAddress);
    I2CMasterControl(MPU9250_I2C_BASE, I2C_MASTER_CMD_BURST_SEND_START);
    while(!I2CMasterBusy(MPU9250_I2C_BASE));
    while(I2CMasterBusy(MPU9250_I2C_BASE));

    I2CMasterDataPut(MPU9250_I2C_BASE, data);
    I2CMasterControl(MPU9250_I2C_BASE, I2C_MASTER_CMD_BURST_SEND_FINISH);
}

/**
 * Read one byte of data from I2C device (performs dummy write as well)
 * @param I2Caddress 7-bit address of I2C device (8. bit is for R/W)
 * @param regAddress address of register in I2C device to write into
 * @return data received from I2C device
 */
int8_t HAL_MPU_ReadByte(uint8_t I2Caddress, uint8_t regAddress)
{
    uint32_t data, dummy = 0;
    UNUSED(dummy);  //Prevent unused-variable warning

    I2CMasterSlaveAddrSet(MPU9250_I2C_BASE, I2Caddress, false);
    I2CMasterDataPut(MPU9250_I2C_BASE, regAddress);
    I2CMasterControl(MPU9250_I2C_BASE, I2C_MASTER_CMD_BURST_SEND_START);
    while(!I2CMasterBusy(MPU9250_I2C_BASE));
    while(I2CMasterBusy(MPU9250_I2C_BASE));

    I2CMasterSlaveAddrSet(MPU9250_I2C_BASE, I2Caddress, true);
    I2CMasterControl(MPU9250_I2C_BASE, I2C_MASTER_CMD_BURST_RECEIVE_START);
    while(!I2CMasterBusy(MPU9250_I2C_BASE));
    while(I2CMasterBusy(MPU9250_I2C_BASE));
    data = I2CMasterDataGet(MPU9250_I2C_BASE);

    I2CMasterControl(MPU9250_I2C_BASE, I2C_MASTER_CMD_BURST_RECEIVE_FINISH);
    while(!I2CMasterBusy(MPU9250_I2C_BASE));
    while(I2CMasterBusy(MPU9250_I2C_BASE));
    dummy = I2CMasterDataGet(MPU9250_I2C_BASE);

    return (data & 0xFF);
}

/**
 * Read several bytes from I2C device (performs dummy write as well)
 * @param I2Caddress 7-bit address of I2C device (8. bit is for R/W)
 * @param regAddress address of register in I2C device to write into
 * @param count number of bytes to red
 * @param dest pointer to data buffer in which data is saved after reading
 */
void HAL_MPU_ReadBytes(uint8_t I2Caddress, uint8_t regAddress,
                       uint8_t count, uint8_t* dest)
{
    uint8_t i;
    for (i = 0; i < count; i++)
    {
        *(dest + i) = HAL_MPU_ReadByte(I2Caddress, regAddress + i);
    }
}

/**
 * Enable pin interrupt used by MPU to signal it has new data available. If
 * interrupt is enabled means a data is expected therefore a timer is started as
 * well to measure time interval between two sensor measurements.
 * @param enable boolean value with new state (1-enable or 0-disable)
 */
void HAL_MPU_IntEnable(bool enable)
{
    if (enable)
    {
        HAL_TIM_Start(0);
        IntEnable(INT_GPIOA);
    }
    else
    {
        HAL_TIM_Stop();
        IntDisable(INT_GPIOA);
    }
}

/**
 * Clear all raised interrupts on port A (pin interrupt by MPU) and return true
 * if interrupt occurred on pin 5 (used by MPU)
 * @return true: if interrupt was raised by pin 5 on port A
 *        false: otherwise
 */
bool HAL_MPU_IntClear()
{
    uint32_t intStat = GPIOIntStatus(GPIO_PORTA_BASE, true);
    GPIOIntClear(GPIO_PORTA_BASE, intStat);

    if ( (intStat & (GPIO_INT_PIN_5)) != GPIO_INT_PIN_5) return false;
    else return true;
}

/**
 * Initialize timer used to precisely measure time interval between two sensor
 * measurements (dt constant used for integration of MPU data)
 */
void HAL_TIM_Init()
{
    /// Set up timer to measure period between two sensor measurements
    SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER7);
    TimerConfigure(TIMER7_BASE, TIMER_CFG_ONE_SHOT_UP);
    /// Set up some big load that should never be reached (dT usually < 1s)
    TimerLoadSet(TIMER7_BASE, TIMER_A, 2*g_ui32SysClock);
}

/**
 * Start the timer to count up from a specified load value
 * @param load desired load value from which to start counting up
 */
void HAL_TIM_Start(uint32_t load)
{
    ///  Set load for Timer7, timer A
    HWREG(TIMER7_BASE + TIMER_O_TAV) = load;
    ///  Start timer
    TimerEnable(TIMER7_BASE, TIMER_A);
}

/**
 * Stop timer
 */
void HAL_TIM_Stop()
{
    TimerDisable(TIMER7_BASE, TIMER_A);
}

/**
 * Get current value of the timer's internal counter
 * @return value of timer's internal counter
 */
uint32_t HAL_TIM_GetValue()
{
    return TimerValueGet(TIMER7_BASE, TIMER_A);
}

/******************************************************************************
 ******************************************************************************
 ************           TM4C peripheral - related API              ************
 ******************************************************************************
 ******************************************************************************/

/**
 * Set desired PWM duty cycle on specific output channel
 * @param id is channel ID of PWM channel affected
 * @param pwm value of PWM pulse (duty cycle) to set
 */
void HAL_SetPWM(uint32_t id, uint32_t pwm)
{
    PWMPulseWidthSet(PWM0_BASE, id, pwm);
}
/**
 * Get current PWM duty cycle on specific output channel
 * @param id is channel ID of PWM channel affected
 * @return PWM duty cycle at channel id
 */
uint32_t HAL_GetPWM(uint32_t id)
{
    return PWMPulseWidthGet(PWM0_BASE, id);
}

