vedranMv/roverRPi3/roverKernel/tm4c1294_hal.c
/******************************************************************************
 ******************************************************************************
 ************            TaskScheduler - related API               ************
 ******************************************************************************
 ******************************************************************************/

/**
 * Setup SysTick interrupt and period
 * @param periodMs time in milliseconds how often to trigger an interrupt
 * @param custHook pointer to function that will be called on SysTick interrupt
 * @return HAL library error code
 */
///Keep track whether the SysTick has already been configured
bool _systickSet = false;
uint32_t _periodMS = 0;
uint8_t HAL_TS_InitSysTick(uint32_t periodMs,void((*custHook)(void)))
{
    /// Forbid configuring the timer period multiple times
    if (_systickSet)
        return HAL_SYSTICK_SET_ERR;
    /// Based on SysTick API 16777216 is biggest allowed number for SysTick
    if (16777216 < (periodMs*(g_ui32SysClock/1000)))
        return HAL_SYSTICK_PEROOR;
    /// And 1 minimum allowed
    if (1 > (periodMs*(g_ui32SysClock/1000)))
            return HAL_SYSTICK_PEROOR;

    SysTickPeriodSet(periodMs*(g_ui32SysClock/1000));
    SysTickIntRegister(custHook);
    IntPrioritySet(FAULT_SYSTICK, 0);
    SysTickIntEnable();
    _systickSet = true;

    _periodMS = periodMs;

    return 0;
}

/**
 * Wrapper for SysTick start function
 */
uint8_t HAL_TS_StartSysTick()
{
    if(_systickSet)
        SysTickEnable();
    else
        return HAL_SYSTICK_NOTSET_ERR;

    return 0;
}

/**
 * Wrapper for SysTick stop function
 */
uint8_t HAL_TS_StopSysTick()
{
    if(_systickSet)
        SysTickDisable();
    else
        return HAL_SYSTICK_NOTSET_ERR;

    return 0;
}

/**
 * Calculate time step between two SysTick interrupts (in milliseconds)
 * @return time step between two SysTicks (in ms)
 */
uint32_t HAL_TS_GetTimeStepMS()
{
    return _periodMS;
}

